import { EventItem } from "@/types/event";

export const initialEvents: EventItem[] = [
    {
        id: '1',
        title: 'Українське кіно: від класики до генеративного мистецтва',
        date: '03.08.2026',
        category: 'Культура',
        description: "Для студентів групи П-227 відбувся особливий захід, який майстерно об'єднав глибоку повагу до національної кіноспадщини та передові цифрові технології."
    },
    {
        id: '2',
        title: 'Урочистий початок нового навчального року в коледжі',
        date: '01.09.2026',
        category: 'Навчання',
        description: "1 вересня в актовій залі коледжу відбувся урочистий захід, присвячений зустрічі студентів першого курсу та їхньому знайомству з наставниками."
    },
    {
        id: '3',
        title: 'Шаную Воїнів, біжу за Героїв України',
        date: '15.09.2026',
        category: 'Спорт',
        description: "29 серпня 2026 року студенти та викладачі спеціальності «Фізична культура і спорт» взяли участь у щорічному Всеукраїнському патріотичному забігу «Шаную Воїнів, біжу за Героїв України»."
    },
    {
        id: '4',
        title: 'День працівників освіти та День коледжу: свято вдячності, тепла та єдності',
        date: '05.10.2026',
        category: 'Культура',
        description: "2 жовтня в актовій залі коледжу панувала особлива, сповнена тепла та щирості атмосфера. Цей день об’єднав одразу дві важливі події — День працівників освіти та День коледжу."
    },
]
